In [7]:
import pandas as pd
import sqlite3

db = sqlite3.connect("data.db")
con = db.cursor()

df = pd.read_excel('data.xlsx')
df.to_sql("data",con =db,if_exists="replace")

7

In [11]:
def Query(Q):
    results = con.execute(Q).fetchall()
    return results

def Querypd(Q):
    return pd.read_sql(Q,db)

In [15]:
# see the count
Q = """
select 
    'data' as dataset,
    count(*) as total_records
from data
"""
Querypd(Q)

  dataset  total_records
0    data              7

In [16]:
Q =  "select * from data"
Querypd(Q)

   index    ID   data gender  age  Salary
0      0  I001  data1      M   23   40000
1      1  I002  data2      M   11   12000
2      2  I003  data3      M   10   10000
3      3  I004  data4      F   17    1500
4      4  I005  data5      F   19    1000
5      5  I005  data5      F   19    1000
6      6  I006   None      M   23   23000

In [23]:
# missing values
Q = """
select 
    'data' as df,
    sum(case when "data" is NULL THEN 1 else 0 end) as nulldata,
    sum(case when "gender" is NULL THEN 1 else 0 end) as nullgender,
    sum(case when "ID" is NULL THEN 1 else 0 end) as nullID,
    sum(case when "Salary" is NULL THEN 1 else 0 end) as nullsalary
from data
"""
Querypd(Q)

     df  nulldata  nullgender  nullID  nullsalary
0  data         1           0       0           0

In [26]:
# create age bracket
Q = """
select 
    age,
    case 
        when age<18 then '0-18'  
        when age<30 then '19-29' 
        else 30+ end as age_bracket
from 
    data
"""
Querypd(Q)

DatabaseError: Execution failed on sql '
select
    age,
    case
        when age<18 then '0-18'
        when age<30 then '19-29'
        else 30+ end as age_bracket
from
    data
': near "as": syntax error

In [27]:
y = pd.read_html("https://olympics.com/en/paris-2024/medals")
len(y)